Revit 2027 API
IDuctFittingAndAccessoryPressureDropServer.Calculate Method
 Calculate the duct fitting and duct accessory coefficient.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool Calculate(
	DuctFittingAndAccessoryPressureDropData data
)
Function Calculate (
	data As DuctFittingAndAccessoryPressureDropData
) As Boolean
bool Calculate(
	DuctFittingAndAccessoryPressureDropData^ data
)
abstract Calculate :
        data : DuctFittingAndAccessoryPressureDropData -> bool
Parameters
data DuctFittingAndAccessoryPressureDropData
 The input and output data of the calculation.
Return Value
Boolean
 True if calculation succeeds. False if calculation fails.
See Also
Reference
IDuctFittingAndAccessoryPressureDropServer Interface
Autodesk.Revit.DB.Mechanical Namespace